# Combining Datasets

In [ ]:
import pandas as pd

data1 = pd.read_csv("/content/Kaggle_Dataset_1.csv")
data2 = pd.read_csv("/content/Kaggle_Dataset_1.csv")

In [ ]:
print(data1.head())
print(data1.info())

   ID           Query                             Job Title  \
0   1  Data Scientist  Junior Data Scientist Apprenticeship
1   2  Data Scientist   HBO Data Scientist, Content Science
2   3  Data Scientist                 Junior Data Scientist
3   4  Data Scientist                     Jr Data Scientist
4   5  Data Scientist       Data Scientist, Premium Content

                                         Description
0  Job Description As a Junior Data Scientist at ...
1  OVERALL SUMMARY As a Data Scientist on the Dat...
2  The Team: The Data science team is a newly for...
3  We now have a need for junior Data Scientist(s...
4  Do you want to help guide the core business of...
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           10000 non-null  int64
 1   Query        10000 non-null  object
 2   Job Title    10000 non-null  object
 3   Description  10000 non-null  object
dtypes: int64(1), object(3)
memory usage: 312.6+ KB
None

In [ ]:
print(data2.head())
print(data2.info())

   Unnamed: 0             Job Title  \
0           0     Flutter Developer
1           1      Django Developer
2           2      Machine Learning
3           3         iOS Developer
4           4  Full Stack Developer

                                     Job Description
0  We are looking for hire experts flutter develo...
1  PYTHON/DJANGO (Developer/Lead) - Job Code(PDJ ...
2  Data Scientist (Contractor)\n\nBangalore, IN\n...
3  JOB DESCRIPTION:\n\nStrong framework outside o...
4  job responsibility full stack engineer â€“ react...
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2277 entries, 0 to 2276
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       2277 non-null   int64
 1   Job Title        2277 non-null   object
 2   Job Description  2277 non-null   object
dtypes: int64(1), object(2)
memory usage: 53.5+ KB
None

In [ ]:
selected_data1 = data1[['Job Title', 'Description']]
selected_data2 = data2[['Job Title', 'Job Description']]
selected_data2.columns = ['Job Title', 'Description']

raw_data = pd.concat([selected_data1, selected_data2], ignore_index=True)
print(raw_data.head())
print(raw_data.info())


raw_data.to_csv('raw_data.csv')

                              Job Title  \
0  Junior Data Scientist Apprenticeship
1   HBO Data Scientist, Content Science
2                 Junior Data Scientist
3                     Jr Data Scientist
4       Data Scientist, Premium Content

                                         Description
0  Job Description As a Junior Data Scientist at ...
1  OVERALL SUMMARY As a Data Scientist on the Dat...
2  The Team: The Data science team is a newly for...
3  We now have a need for junior Data Scientist(s...
4  Do you want to help guide the core business of...
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12277 entries, 0 to 12276
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Job Title    12277 non-null  object
 1   Description  12277 non-null  object
dtypes: object(2)
memory usage: 192.0+ KB
None

#Data Cleaning

##Missing values

In [ ]:
missing_values = raw_data.isnull().sum()
print(missing_values)

Job Title      0
Description    0
dtype: int64

As we can see no missing values and we can verify this by checking if there were any missing values in the orginal two datasets

In [ ]:
data1.isnull().sum()

ID             0
Query          0
Job Title      0
Description    0
dtype: int64

In [ ]:
data2.isnull().sum()

Unnamed: 0         0
Job Title          0
Job Description    0
dtype: int64